<template>
  <div
    v-if="type === 'type'"
    class="type"
    style="height:280px; overflow:auto; font-size:12px;line-height:16px;"
  >
    <h2>企业评价分类</h2>
    <div>
      <h4>A类：</h4>
      <p> 为重点发展类,是指资源占用产出高、经营效益好、转型升级发展成效明显的企业（主要涵盖高精尖产业及其对应的企业）。</p>
    </div>
    <div>
      <h4>B类：</h4>
      <p> 是鼓励提升类,是指资源占用产出较高、经营效益较好,发展水平可以进一步提升的企业。</p>
    </div>
    <div>
      <h4>C类：</h4>
      <p> 是监管调控类,是指资源利用效率偏低、综合效益不佳,需要重点帮扶、引导升级的企业。</p>
    </div>
    <div>
      <h4>D类：</h4>
      <p> 是落后整治类,是指综合效益差,需倒逼整治的企业。</p>
    </div>
  </div>
  <div
    v-else
    class="scrollBar"
    style="height: 280px; overflow:auto; font-size:12px;"
  >
    <h2>资源要素应用情况</h2>
    <h4>
      A 类企业
    </h4>
    <pre>
      1．优先适用财政鼓励政策；
      2．优先进行项目核准（备案），保障用地需求；
      3．优先保障用电、用水和新增用能需求；
      4．各类申报项目、政府评先评优等荣誉称号的
          重点推荐对象；
      5．银行授信和金融机构信贷的重点对象；
      6．规上A类企业减征城镇土地使用税70%；规下
          A类企业减征城镇土地使用税40%；
      7．优先适用其它要素资源的保障。
    </pre>
    <h4>
      B 类企业
    </h4>
    <pre>
      1．在用地、用电、用水、用能、融资等方面给
         予适当支持；
      2．鼓励企业进行土地再开发，利用合法占用土
          地、厂房、设施资源实施“零增地”技改，
          对内涵提升类技术改造项目予以优先立项；
      3．规上B类企业减征城镇土地使用税40%；规下
          B类企业减征城镇土地使用税30%；
      4．支持污染物排污权等交易。
    </pre>
    <h4>
      C 类企业
    </h4>
    <pre>
       1．支持开展节能减排、清洁生产等技术改造。
           在符合产业导向的前提下支持企业开展
           “零土地”技术改造以增产提质；
       2．不予减征城镇土地使用税；
       3．启动有序用电方案时，作为限电对象；
       4．相应控制信贷支持，除支持企业进行技术
           改造转型升级之外，在信贷等融资产品上
           从严掌握和控制；
       5．不得参评年度各项先进。
    </pre>
    <h4>
      D 类企业
    </h4>
    <pre>
        1．不予核准和备案与原有产出水平相同的
            或是简单重复类的项目；原则上不安排
            新增工业用地；
        2．不予减征城镇土地使用税；
        3．限制新增用能需求，限制通过申购、租
            赁等各种途径新增排污总量。
        4．启用有序用电方案时，作为首要限电对象；
        5．实施差别化电价政策，企业用电价格提高
            0.3元/每千瓦时。
    </pre>
  </div>
</template>

<script>
export default {
  props: {
    type: {
      type: String,
      default: 'type'
    }
  }
}
</script>

<style lang="less" scoped>
// .type {
h2 {
  line-height: 30px;
  text-align: center;
}
h4 {
  line-height: 30px;
}
// }
</style>